In [1]:
dic = {
    "name":["Raushan","Rahul","Gautam"],
    "age":[21,34,23]
}

In [2]:
import pandas as pd
df = pd.DataFrame(dic)

In [3]:
df

      name  age
0  Raushan   21
1    Rahul   34
2   Gautam   23

In [4]:
df["name"]

0    Raushan
1      Rahul
2     Gautam
Name: name, dtype: object

In [5]:
df.iloc[1]

name    Rahul
age        34
Name: 1, dtype: object

In [6]:
df["city"] = ["delhi","mumbai","kolkata"]

In [7]:
df

      name  age     city
0  Raushan   21    delhi
1    Rahul   34   mumbai
2   Gautam   23  kolkata

In [8]:
data = {
    'Name': ['Aman', 'Riya', 'Neha', 'Tushar'],
    'Age': [20, 22, 19, 21],
    'Marks': [85, 92, 76, 89]
}

df = pd.DataFrame(data)

In [9]:
df2 = pd.DataFrame(data)

In [10]:
df2

     Name  Age  Marks
0    Aman   20     85
1    Riya   22     92
2    Neha   19     76
3  Tushar   21     89

In [12]:
df2[df2["Marks"]>85]

     Name  Age  Marks
1    Riya   22     92
3  Tushar   21     89

In [14]:
df2[df2["Age"]>21]

   Name  Age  Marks
1  Riya   22     92

In [17]:
df2.sort_values(["Age"],ascending=False)

     Name  Age  Marks
1    Riya   22     92
3  Tushar   21     89
0    Aman   20     85
2    Neha   19     76

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Marks   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [19]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Marks   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [20]:
df2.describe()

             Age      Marks
count   4.000000   4.000000
mean   20.500000  85.500000
std     1.290994   6.952218
min    19.000000  76.000000
25%    19.750000  82.750000
50%    20.500000  87.000000
75%    21.250000  89.750000
max    22.000000  92.000000

In [21]:
df2.to_csv("Raushan.csv",index=False)

In [22]:
rau = pd.read_csv("Raushan.csv")

In [23]:
rau

     Name  Age  Marks
0    Aman   20     85
1    Riya   22     92
2    Neha   19     76
3  Tushar   21     89